Revit 2027 API
ViewPlan.GetUnderlayTopLevel Method
 Returns the element id of the level that defines the top of the underlay range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetUnderlayTopLevel()
Public Function GetUnderlayTopLevel As ElementId
public:
ElementId^ GetUnderlayTopLevel()
member GetUnderlayTopLevel : unit -> ElementId
Return Value
ElementId
 If the underlay base level is a valid level, and this method returns InvalidElementId, then the underlay range is unbounded, and consists of everything above the underlay base level.
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace